Tekla.Structures.Model.BoltCircle
The BoltCircle class defines a bolt group with a circle shape.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
public class Example
{
public void Example1()
{
ContourPlate cp = new ContourPlate();
cp.AddContourPoint(new ContourPoint(new Point( 9000,  6000, 0),null));
cp.AddContourPoint(new ContourPoint(new Point(12000,  6000, 0),null));
cp.AddContourPoint(new ContourPoint(new Point(12000, 12000, 0),null));
cp.AddContourPoint(new ContourPoint(new Point( 9000, 12000, 0),null));
if (!cp.Insert())
Console.WriteLine("ContourPlate Insert failed!");
BoltCircle B = new BoltCircle();
B.PartToBeBolted = cp;
B.PartToBoltTo   = cp;
B.FirstPosition  = new Point( 9000,  6000, 0);
B.SecondPosition = new Point(12000, 12000, 0);
B.BoltSize     = 16;
B.Tolerance    = 3.00;
B.BoltStandard = "7968";
B.BoltType     = BoltGroup.BoltTypeEnum.BOLT_TYPE_WORKSHOP;
B.CutLength    = 105;
B.Length       = 100;
B.ExtraLength  = 15;
B.ThreadInMaterial = BoltGroup.BoltThreadInMaterialEnum.THREAD_IN_MATERIAL_NO;
B.Position.Depth          = Position.DepthEnum.MIDDLE;
B.Position.Plane          = Position.PlaneEnum.MIDDLE;
B.Position.Rotation       = Position.RotationEnum.FRONT;
B.Bolt    = true;
B.Washer1 = true;
B.Washer2 = true;
B.Washer3 = true;
B.Nut1    = true;
B.Nut2    = true;
B.Hole1   = true;
B.Hole2   = true;
B.Hole3   = true;
B.Hole4   = true;
B.Hole5   = true;
B.NumberOfBolts = 7;
B.Diameter      = 160;
if (!B.Insert())
Console.WriteLine("BoltCircle Insert failed!");
}
}